renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/type2/src/boot_loader.c
extern void my_sw_charget_function(void);
extern void my_sw_charput_function(uint8_t data);

static FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank0 = (FIRMWARE_UPDATE_CONTROL_BLOCK*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS;
static FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank1 = (FIRMWARE_UPDATE_CONTROL_BLOCK*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static LOAD_CONST_DATA_CONTROL_BLOCK load_const_data_control_block;
static uint32_t secure_boot_state = BOOT_LOADER_STATE_INITIALIZING;
static uint32_t flash_error_code;

/* Handle storage. */
sci_hdl_t     my_sci_handle;
SCI_RECEIVE_CONTROL_BLOCK sci_receive_control_block;
SCI_BUFFER_CONTROL sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_TOTAL_NUM];

void main(void)
{
    int32_t result_secure_boot;
    nop();
    while(1)
    {
		result_secure_boot = secure_boot();
		if (BOOT_LOADER_SUCCESS == result_secure_boot)
		{
			/* stop all interrupt completely */
			set_psw(0);
			uint32_t addr;
			addr = *(uint32_t*)USER_RESET_VECTOR_ADDRESS;
			((void (*)())addr)();
			while(1); /* infinite loop */
		}
		else if (BOOT_LOADER_FAIL == result_secure_boot)
		{
			while(1)
			{
				/* infinity loop */
			}
		}
		else if (BOOT_LOADER_IN_PROGRESS == result_secure_boot)
		{
			continue;
		}
		else
		{
			while(1)
			{
				/* infinite loop */
			}
		}
    }
}

static int32_t secure_boot(void)
{
    flash_err_t flash_api_error_code = FLASH_SUCCESS;
    int32_t secure_boot_error_code = BOOT_LOADER_IN_PROGRESS;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
    uint32_t bank_info = 255;
    flash_interrupt_config_t cb_func_info;
	FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_tmp = (FIRMWARE_UPDATE_CONTROL_BLOCK*)load_firmware_control_block.flash_buffer;

    switch(secure_boot_state)
    {
    	case BOOT_LOADER_STATE_INITIALIZING:
			R_SCI_PinSet_serial_term();

    	    sci_cfg_t   my_sci_config;
    	    sci_err_t   my_sci_err;

    	    /* Set up the configuration data structure for asynchronous (UART) operation. */
    	    my_sci_config.async.baud_rate    = SCI_BAUD_RATE;
    	    my_sci_config.async.clk_src      = SCI_CLK_INT;
    	    my_sci_config.async.data_size    = SCI_DATA_8BIT;
    	    my_sci_config.async.parity_en    = SCI_PARITY_OFF;
    	    my_sci_config.async.parity_type  = SCI_EVEN_PARITY;
    	    my_sci_config.async.stop_bits    = SCI_STOPBITS_1;
    	    my_sci_config.async.int_priority = SCI_INTERRUPT_PRIORITY;

    	    /* OPEN ASYNC CHANNEL
    	    *  Provide address of the configure structure,
    	    *  the callback function to be assigned,
    	    *  and the location for the handle to be stored.*/
    	    my_sci_err = R_SCI_Open(SCI_CH_serial_term, SCI_MODE_ASYNC, &my_sci_config, my_sci_callback, &my_sci_handle);

    	    /* If there were an error this would demonstrate error detection of API calls. */
    	    if (SCI_SUCCESS != my_sci_err)
    	    {
    	        nop(); // Your error handling code would go here.
				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
				secure_boot_error_code = BOOT_LOADER_FAIL;
				break;
    	    }

    	    load_firmware_control_block.progress = 0;
    	    load_firmware_control_block.offset = 0;

    	    flash_api_error_code = R_FLASH_Open();
    	    if (FLASH_SUCCESS == flash_api_error_code)
    	    {
    	        /* nothing to do */
    	    }
    	    else
    	    {
    	        printf("R_FLASH_Open() returns error. %d.\r\n", flash_error_code);
    	        printf("system error.\r\n");
				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
				secure_boot_error_code = BOOT_LOADER_FAIL;
    	    }

    	    /* startup system */
    	    printf("-------------------------------------------------\r\n");
    	    printf("RX65N secure boot program\r\n");
    	    printf("-------------------------------------------------\r\n");

    	    printf("Checking flash ROM status.\r\n");

    	    printf("bank 0 status = 0x%x [%s]\r\n", firmware_update_control_block_bank0->image_flag, get_status_string(firmware_update_control_block_bank0->image_flag));
    	    printf("bank 1 status = 0x%x [%s]\r\n", firmware_update_control_block_bank1->image_flag, get_status_string(firmware_update_control_block_bank1->image_flag));

    	    R_FLASH_Control(FLASH_CMD_BANK_GET, &bank_info);
    	    printf("bank info = %d. (start bank = %d)\r\n", bank_info, (bank_info ^ 0x01));

    		cb_func_info.pcallback = my_flash_callback;
    		cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
    	    R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
    	    secure_boot_state = BOOT_LOADER_STATE_BANK1_CHECK;
    		break;

    	case BOOT_LOADER_STATE_BANK1_CHECK:
    		if(firmware_update_control_block_bank1->image_flag == LIFECYCLE_STATE_TESTING)
    		{
    	    	memcpy(load_firmware_control_block.flash_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, FLASH_CF_MEDIUM_BLOCK_SIZE);

    	    	printf("bank1(temporary area) on code flash hash check...");
    	        R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
    	        		hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
    	        if(0 == memcmp(hash_sha1, firmware_update_control_block_bank1->signature, SHA1_HASH_LENGTH_BYTE_SIZE))
    	        {
    	            printf("OK\r\n");
    	        	firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_VALID;
    	        }
    	        else
    	        {
    	            printf("NG\r\n");
    	        	firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_INVALID;
    	        }
    	    	printf("update LIFECYCLE_STATE from [%s] to [%s]\r\n", get_status_string(firmware_update_control_block_bank1->image_flag), get_status_string(firmware_update_control_block_tmp->image_flag));
    	    	printf("bank1(temporary area) block0 erase (to update LIFECYCLE_STATE)...");
    	    	flash_api_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);
    	        if (FLASH_SUCCESS != flash_api_error_code)
    	        {
    	            printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
    	            printf("system error.\r\n");
					secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
					secure_boot_error_code = BOOT_LOADER_FAIL;
    	            break;
    	        }
    			secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT;
    		}
    		else
    		{
				if (firmware_update_control_block_bank0->image_flag == LIFECYCLE_STATE_VALID)
				{
					secure_boot_state = BOOT_LOADER_STATE_BANK0_UPDATE_CHECK;
	    		}
	    		else
	    		{
	    			secure_boot_state = BOOT_LOADER_STATE_BANK0_CHECK;
				}
    		}
			break;

    	case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT:
    		/* this state will be update by flash callback */
    		break;

    	case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE:
	        if (FLASH_SUCCESS == flash_error_code)
	        {
	            printf("OK\r\n");
	        }
	        else
	        {
	            printf("R_FLASH_Erase() callback error. %d.\r\n", flash_error_code);
	            printf("system error.\r\n");
	            secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
	            break;
	        }
	        printf("bank1(temporary area) block0 write (to update LIFECYCLE_STATE)...");
	        flash_api_error_code = R_FLASH_Write((uint32_t)firmware_update_control_block_tmp, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, FLASH_CF_MEDIUM_BLOCK_SIZE);
			if (FLASH_SUCCESS != flash_api_error_code)
			{
				printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
				printf("system error.\r\n");
				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
				secure_boot_error_code = BOOT_LOADER_FAIL;
				break;
			}
			secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT;
			break;

    	case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT:
    		/* this state will be update by flash callback */
    		break;

    	case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE:
	        if (FLASH_SUCCESS == flash_error_code)
	        {
	            printf("OK\r\n");
	        }
	        else
	        {
	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
	            printf("system error.\r\n");
				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
				secure_boot_error_code = BOOT_LOADER_FAIL;
	            break;
	        }
	        printf("swap bank...\r\n");
			R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
			bank_swap_with_software_reset();
			while(1);
			break;

    	case BOOT_LOADER_STATE_BANK0_CHECK:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE1:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_COMPLETE:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
    	case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
    	case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
		case BOOT_LOADER_STATE_BANK0_UPDATE_CHECK:
		case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
		case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE:
    	case BOOT_LOADER_STATE_FINALIZE:
    	    switch(firmware_update_control_block_bank0->image_flag)
    	    {
    	        case LIFECYCLE_STATE_BLANK:
    	        	switch(secure_boot_state)
					{
    	        		case BOOT_LOADER_STATE_BANK0_CHECK:
							printf("start installing user program.\r\n");
							printf("erase bank1 secure boot mirror area...");
							flash_api_error_code = R_FLASH_Erase(BOOT_LOADER_MIRROR_HIGH_ADDRESS, BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL + BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
							if(FLASH_SUCCESS != flash_api_error_code)
							{
								printf("NG\r\n");
								printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
								secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
								secure_boot_error_code = BOOT_LOADER_FAIL;
								break;
							}
							secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT;
							break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
    	        	        if (FLASH_SUCCESS == flash_error_code)
    	        	        {
    	        	            printf("OK\r\n");
    	        	        }
    	        	        else
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }
    	        	        printf("copy secure boot (part1) from bank0 to bank1...");
    	        	        flash_api_error_code = R_FLASH_Write((uint32_t)BOOT_LOADER_LOW_ADDRESS, (uint32_t)BOOT_LOADER_MIRROR_LOW_ADDRESS, ((uint32_t)BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM) * FLASH_CF_MEDIUM_BLOCK_SIZE);
							if(FLASH_SUCCESS != flash_api_error_code)
							{
								printf("NG\r\n");
								printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
								secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
								secure_boot_error_code = BOOT_LOADER_FAIL;
								break;
							}
							secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1;
							break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE1:
    	        	        if (FLASH_SUCCESS == flash_error_code)
    	        	        {
    	        	            printf("OK\r\n");
    	        	        }
    	        	        else
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }
    	        	        printf("copy secure boot (part2) from bank0 to bank1...");
							if(BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM > 0)
							{
								flash_api_error_code = R_FLASH_Write((uint32_t)FLASH_CF_BLOCK_7, (uint32_t)FLASH_CF_BLOCK_45, 8 * FLASH_CF_SMALL_BLOCK_SIZE);
								if(FLASH_SUCCESS != flash_api_error_code)
								{
									printf("NG\r\n");
									printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
									secure_boot_error_code = BOOT_LOADER_FAIL;
									break;
								}
							}
							else
							{
								secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2;
							}
							secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2;
							break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2:
    	        	        if (FLASH_SUCCESS == flash_error_code)
    	        	        {
    	        	            printf("OK\r\n");
    	        	        }
    	        	        else
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }
							printf("========== install user program phase ==========\r\n");
							printf("erase install area (data flash): ");
							flash_api_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS, BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
							if (FLASH_SUCCESS != flash_api_error_code)
							{
								printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
								printf("system error.\r\n");
								secure_boot_error_code = BOOT_LOADER_FAIL;
								break;
							}
							secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT;
							break;

    	        		case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
    	        	        if (FLASH_SUCCESS == flash_error_code)
    	        	        {
    	        	            printf("OK\r\n");
    	        	        }
    	        	        else
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }
							printf("erase install area (code flash): ");
							flash_api_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
							if (FLASH_SUCCESS != flash_api_error_code)
							{
								printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
								printf("system error.\r\n");
								secure_boot_error_code = BOOT_LOADER_FAIL;
								break;
							}
							secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT;
							break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
    	        	        if (FLASH_SUCCESS == flash_error_code)
    	        	        {
    	        	            printf("OK\r\n");
    	        	        }
    	        	        else
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }
    	        	        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
    	        	        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
							sci_receive_control_block.p_sci_buffer_control = &sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A];
							sci_receive_control_block.current_state = BOOT_LOADER_SCI_CONTROL_BLOCK_A;
    	        	        printf("send \"%s\" via UART.\r\n", INITIAL_FIRMWARE_FILE_NAME);
							secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT;
    	        	        break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:
							/* install code flash area */
							if(!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
							{
								flash_api_error_code = R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + load_firmware_control_block.offset, sizeof(load_firmware_control_block.flash_buffer));
								if (FLASH_SUCCESS != flash_api_error_code)
								{
									printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
									printf("system error.\r\n");
									secure_boot_error_code = BOOT_LOADER_FAIL;
									break;
								}
								secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT;
							}
							break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
    	            		/* this state will be update by flash callback */
    	        			break;

    	        		case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
    	        	        if (FLASH_SUCCESS != flash_error_code)
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }

