renesas/amazon-freertos/demos/renesas/rx65n-rsk/e2studio/ccrx/boot_loader/type2/src/boot_loader.c
							load_firmware_control_block.offset += FLASH_CF_MEDIUM_BLOCK_SIZE;
							load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))*100));
							printf("installing firmware...%d%(%d/%dKB).\r", load_firmware_control_block.progress, load_firmware_control_block.offset/1024, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)/1024);
							if(load_firmware_control_block.offset < (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
							{
								/* one more loop */
								secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT;
							}
							else if(load_firmware_control_block.offset == (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
							{
								printf("\n");
								printf("completed installing firmware.\r\n");
								printf("code flash hash check...");
								R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
										hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
								if(0 == memcmp(hash_sha1, firmware_update_control_block_bank1->signature, SHA1_HASH_LENGTH_BYTE_SIZE))
								{
									printf("OK\r\n");
									load_const_data_control_block.offset = 0;
									secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT;
								}
								else
								{
									printf("NG\r\n");
	    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
	    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
								}
							}
							else
							{
								printf("\n");
								printf("fatal error occurred.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
							}
							break;

						case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT:
							/* install data flash area */
							if(!const_data_block_read(load_const_data_control_block.flash_buffer, load_const_data_control_block.offset))
							{
								secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE;
							}
							break;

						case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
							flash_api_error_code = R_FLASH_Write((uint32_t)&load_const_data_control_block.flash_buffer[load_const_data_control_block.offset/4], (uint32_t)BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS + load_const_data_control_block.offset, FLASH_DF_BLOCK_SIZE);
							if (FLASH_SUCCESS != flash_api_error_code)
							{
								printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
								printf("system error.\r\n");
								secure_boot_error_code = BOOT_LOADER_FAIL;
								break;
							}
							secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT;
							break;

						case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
    	            		/* this state will be update by flash callback */
							break;
						
						case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
    	        	        if (FLASH_SUCCESS != flash_error_code)
    	        	        {
    	        	            printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
    	        	            printf("system error.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
    	        	            break;
    	        	        }

							load_const_data_control_block.offset += FLASH_DF_BLOCK_SIZE;
							load_const_data_control_block.progress = (uint32_t)(((float)(load_const_data_control_block.offset)/(float)((FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))*100));
							static uint32_t previous_offset = 0;
							if(previous_offset != (load_const_data_control_block.offset/1024))
							{
								printf("installing const data...%d%(%d/%dKB).\r", load_const_data_control_block.progress, load_const_data_control_block.offset/1024, (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER)/1024);
								previous_offset = load_const_data_control_block.offset/1024;
							}
							if(load_const_data_control_block.offset < (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
							{
								/* one more loop */
								secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE;
							}
							else if(load_const_data_control_block.offset == (FLASH_DF_BLOCK_SIZE * BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
							{
								printf("\n");
								printf("completed installing const data.\r\n");
								printf("software reset...\r\n");
								R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
								software_reset();
							}
							else
							{
								printf("\n");
								printf("fatal error occurred.\r\n");
    	        				secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
    	        				secure_boot_error_code = BOOT_LOADER_FAIL;
							}
							break;
					}
    				break;
    	        case LIFECYCLE_STATE_TESTING:
    	            printf("illegal status\r\n");
    	            printf("swap bank...");
    	            R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
    	            bank_swap_with_software_reset();
    	            while(1);
    	            break;
    	        case LIFECYCLE_STATE_VALID:
					switch(secure_boot_state)
					{
						case BOOT_LOADER_STATE_BANK0_UPDATE_CHECK:
		    	            printf("bank0(execute area) on code flash hash check...");
		    	            R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
		    	            		hash_sha1, (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
		    	            if(!memcmp(firmware_update_control_block_bank0->signature, hash_sha1, sizeof(hash_sha1)))
		    	            {
		    	                printf("OK\r\n");
		    	            	if(firmware_update_control_block_bank1->image_flag != LIFECYCLE_STATE_BLANK)
		    	            	{
		    	                    printf("erase install area (code flash): ");
		    	                    flash_api_error_code = R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
		    	                    if (FLASH_SUCCESS != flash_api_error_code)
		    	                    {
		    	                        printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
		    	                        printf("system error.\r\n");
										secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
										secure_boot_error_code = BOOT_LOADER_FAIL;
					    	            break;
					    	        }
									secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT;
								}
								else
								{
									secure_boot_state = BOOT_LOADER_STATE_FINALIZE;
								}
		    	            }
		    	            else
		    	            {
		    					printf("NG.\r\n");
		    					printf("Code flash is completely broken.\r\n");
		    					printf("Please erase all code flash.\r\n");
		    					printf("And, write secure boot using debugger.\r\n");
								secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
		    					secure_boot_error_code = BOOT_LOADER_FAIL;
		    	            }
		    	            break;

